%%%%%%%%%%%%%%%%%%%%%%%
%%% Author: Chao Li %%%
%%%%%%%%%%%%%%%%%%%%%%%

%建立多目标运动物体模型

%   物体运动模型设置     %
% R0=70; %初始距离
% v0=-4; %初始速度,接近雷达方向为负
% a=-3; %加速度
% 
% sita0=50;%初始角度
% sita_a=1;%角度变化加速度
% sita_v0=1;%角度变化初始速度
% 
% v=v0+a.*t;
% R=R0-(v0.*t + 0.5*a.*t.^2);
% sita=sita0 + sita_v0.*t + 0.5*sita_a.*t.^2;

%[实时速度，实时距离，实时角度] = mbpara(初始距离，初始速度，加速度，初始角度，角度变化加速度，角度变化初始速度，时间)
[v1, R1, sita1] = mbpara(70,-4,-3,50,1,1,t);

%      静止物体         %
R1=72;sita1=50;
%R2=80;sita2=50;
%                        %
%%%%%%%%%%%%%%%%%%%%%%%%%%