%%%%%%%%%%%%%%%%%%%%%%%
%%% Author: Chao Li %%%
%%%%%%%%%%%%%%%%%%%%%%%

%建立多目标运动物体模型

Rmax=300; %最大处理距离

%%%%%%%%%%%%%%%初始化map图%%%%%%%%%%%%%%%%%
map=ones(fix(Rmax/0.1), 180)*(-1); %map图距离维最小单元为0.1m，角度维最小距离为1度

%%%%%%%%%%%%%%%%%%%%%%%%%%
%   物体运动模型设置     %
R0=70; %初始距离
v0=-4; %初始速度,接近雷达方向为正
a=-3; %加速度

sita0=50;%初始角度
sita_a=1;%角度变化加速度
sita_v0=1;%角度变化初始速度

v=v0+a.*t;
R=R0-(v0.*t + 0.5*a.*t.^2);
sita=sita0 + sita_v0.*t + 0.5*sita_a.*t.^2;

%      静止物体         %
R1=72;sita1=50;
%R2=80;sita2=50;
%                        %
%%%%%%%%%%%%%%%%%%%%%%%%%%